Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxSrc_reg.h
/** \brief 9C, ASCLIN6 Receive Service Request */
#define SRC_ASCLIN_ASCLIN6_RX /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF003809Cu)
/** Alias (User Manual Name) for SRC_ASCLIN_ASCLIN6_RX.
* To use register names with standard convension, please use SRC_ASCLIN_ASCLIN6_RX.
*/
#define SRC_ASCLIN6RX (SRC_ASCLIN_ASCLIN6_RX)

/** \brief A0, ASCLIN6 Error Service Request */
#define SRC_ASCLIN_ASCLIN6_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00380A0u)
/** Alias (User Manual Name) for SRC_ASCLIN_ASCLIN6_ERR.
* To use register names with standard convension, please use SRC_ASCLIN_ASCLIN6_ERR.
*/
#define SRC_ASCLIN6ERR (SRC_ASCLIN_ASCLIN6_ERR)

/** \brief A4, ASCLIN7 Transmit Service Request */
#define SRC_ASCLIN_ASCLIN7_TX /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00380A4u)
/** Alias (User Manual Name) for SRC_ASCLIN_ASCLIN7_TX.
* To use register names with standard convension, please use SRC_ASCLIN_ASCLIN7_TX.
*/
#define SRC_ASCLIN7TX (SRC_ASCLIN_ASCLIN7_TX)

/** \brief A8, ASCLIN7 Receive Service Request */
#define SRC_ASCLIN_ASCLIN7_RX /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00380A8u)
/** Alias (User Manual Name) for SRC_ASCLIN_ASCLIN7_RX.
* To use register names with standard convension, please use SRC_ASCLIN_ASCLIN7_RX.
*/
#define SRC_ASCLIN7RX (SRC_ASCLIN_ASCLIN7_RX)

/** \brief AC, ASCLIN7 Error Service Request */
#define SRC_ASCLIN_ASCLIN7_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00380ACu)
/** Alias (User Manual Name) for SRC_ASCLIN_ASCLIN7_ERR.
* To use register names with standard convension, please use SRC_ASCLIN_ASCLIN7_ERR.
*/
#define SRC_ASCLIN7ERR (SRC_ASCLIN_ASCLIN7_ERR)

/** \brief B0, ASCLIN8 Transmit Service Request */
#define SRC_ASCLIN_ASCLIN8_TX /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00380B0u)
/** Alias (User Manual Name) for SRC_ASCLIN_ASCLIN8_TX.
* To use register names with standard convension, please use SRC_ASCLIN_ASCLIN8_TX.
*/
#define SRC_ASCLIN8TX (SRC_ASCLIN_ASCLIN8_TX)

/** \brief B4, ASCLIN8 Receive Service Request */
#define SRC_ASCLIN_ASCLIN8_RX /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00380B4u)
/** Alias (User Manual Name) for SRC_ASCLIN_ASCLIN8_RX.
* To use register names with standard convension, please use SRC_ASCLIN_ASCLIN8_RX.
*/
#define SRC_ASCLIN8RX (SRC_ASCLIN_ASCLIN8_RX)

/** \brief B8, ASCLIN8 Error Service Request */
#define SRC_ASCLIN_ASCLIN8_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00380B8u)
/** Alias (User Manual Name) for SRC_ASCLIN_ASCLIN8_ERR.
* To use register names with standard convension, please use SRC_ASCLIN_ASCLIN8_ERR.
*/
#define SRC_ASCLIN8ERR (SRC_ASCLIN_ASCLIN8_ERR)

/** \brief BC, ASCLIN9 Transmit Service Request */
#define SRC_ASCLIN_ASCLIN9_TX /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00380BCu)
/** Alias (User Manual Name) for SRC_ASCLIN_ASCLIN9_TX.
* To use register names with standard convension, please use SRC_ASCLIN_ASCLIN9_TX.
*/
#define SRC_ASCLIN9TX (SRC_ASCLIN_ASCLIN9_TX)

/** \brief C0, ASCLIN9 Receive Service Request */
#define SRC_ASCLIN_ASCLIN9_RX /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00380C0u)
/** Alias (User Manual Name) for SRC_ASCLIN_ASCLIN9_RX.
* To use register names with standard convension, please use SRC_ASCLIN_ASCLIN9_RX.
*/
#define SRC_ASCLIN9RX (SRC_ASCLIN_ASCLIN9_RX)

/** \brief C4, ASCLIN9 Error Service Request */
#define SRC_ASCLIN_ASCLIN9_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00380C4u)
/** Alias (User Manual Name) for SRC_ASCLIN_ASCLIN9_ERR.
* To use register names with standard convension, please use SRC_ASCLIN_ASCLIN9_ERR.
*/
#define SRC_ASCLIN9ERR (SRC_ASCLIN_ASCLIN9_ERR)

/** \brief C8, ASCLIN10 Transmit Service Request */
#define SRC_ASCLIN_ASCLIN10_TX /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00380C8u)
/** Alias (User Manual Name) for SRC_ASCLIN_ASCLIN10_TX.
* To use register names with standard convension, please use SRC_ASCLIN_ASCLIN10_TX.
*/
#define SRC_ASCLIN10TX (SRC_ASCLIN_ASCLIN10_TX)

/** \brief CC, ASCLIN10 Receive Service Request */
#define SRC_ASCLIN_ASCLIN10_RX /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00380CCu)
/** Alias (User Manual Name) for SRC_ASCLIN_ASCLIN10_RX.
* To use register names with standard convension, please use SRC_ASCLIN_ASCLIN10_RX.
*/
#define SRC_ASCLIN10RX (SRC_ASCLIN_ASCLIN10_RX)

/** \brief D0, ASCLIN10 Error Service Request */
#define SRC_ASCLIN_ASCLIN10_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00380D0u)
/** Alias (User Manual Name) for SRC_ASCLIN_ASCLIN10_ERR.
* To use register names with standard convension, please use SRC_ASCLIN_ASCLIN10_ERR.
*/
#define SRC_ASCLIN10ERR (SRC_ASCLIN_ASCLIN10_ERR)

/** \brief D4, ASCLIN11 Transmit Service Request */
#define SRC_ASCLIN_ASCLIN11_TX /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00380D4u)
/** Alias (User Manual Name) for SRC_ASCLIN_ASCLIN11_TX.
* To use register names with standard convension, please use SRC_ASCLIN_ASCLIN11_TX.
*/
#define SRC_ASCLIN11TX (SRC_ASCLIN_ASCLIN11_TX)

/** \brief D8, ASCLIN11 Receive Service Request */
#define SRC_ASCLIN_ASCLIN11_RX /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00380D8u)
/** Alias (User Manual Name) for SRC_ASCLIN_ASCLIN11_RX.
* To use register names with standard convension, please use SRC_ASCLIN_ASCLIN11_RX.
*/
#define SRC_ASCLIN11RX (SRC_ASCLIN_ASCLIN11_RX)

/** \brief DC, ASCLIN11 Error Service Request */
#define SRC_ASCLIN_ASCLIN11_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00380DCu)
/** Alias (User Manual Name) for SRC_ASCLIN_ASCLIN11_ERR.
* To use register names with standard convension, please use SRC_ASCLIN_ASCLIN11_ERR.
*/
#define SRC_ASCLIN11ERR (SRC_ASCLIN_ASCLIN11_ERR)

/** \brief EC, MTU Done Service Request */
#define SRC_MTUDONE /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00380ECu)

/** \brief F0, QSPI0 Transmit Service Request */
#define SRC_QSPI_QSPI0_TX /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00380F0u)
/** Alias (User Manual Name) for SRC_QSPI_QSPI0_TX.
* To use register names with standard convension, please use SRC_QSPI_QSPI0_TX.
*/
#define SRC_QSPI0TX (SRC_QSPI_QSPI0_TX)

/** \brief F4, QSPI0 Receive Service Request */
#define SRC_QSPI_QSPI0_RX /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00380F4u)
/** Alias (User Manual Name) for SRC_QSPI_QSPI0_RX.
* To use register names with standard convension, please use SRC_QSPI_QSPI0_RX.
*/
#define SRC_QSPI0RX (SRC_QSPI_QSPI0_RX)

/** \brief F8, QSPI0 Error Service Request */
#define SRC_QSPI_QSPI0_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF00380F8u)
/** Alias (User Manual Name) for SRC_QSPI_QSPI0_ERR.
* To use register names with standard convension, please use SRC_QSPI_QSPI0_ERR.
*/
#define SRC_QSPI0ERR (SRC_QSPI_QSPI0_ERR)

