Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxSrc_reg.h
/** \brief 924, DAM0 Error Service Request */
#define SRC_DAM_DAM0_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038924u)
/** Alias (User Manual Name) for SRC_DAM_DAM0_ERR.
* To use register names with standard convension, please use SRC_DAM_DAM0_ERR.
*/
#define SRC_DAM0ERR (SRC_DAM_DAM0_ERR)

/** \brief 928, DAM1 Limit 0 Service Request */
#define SRC_DAM_DAM1_LI0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038928u)
/** Alias (User Manual Name) for SRC_DAM_DAM1_LI0.
* To use register names with standard convension, please use SRC_DAM_DAM1_LI0.
*/
#define SRC_DAM1LI0 (SRC_DAM_DAM1_LI0)

/** \brief 92C, DAM1 Ready 0 Service Reques */
#define SRC_DAM_DAM1_RI0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF003892Cu)
/** Alias (User Manual Name) for SRC_DAM_DAM1_RI0.
* To use register names with standard convension, please use SRC_DAM_DAM1_RI0.
*/
#define SRC_DAM1RI0 (SRC_DAM_DAM1_RI0)

/** \brief 930, DAM1 Limit 1 Service Request */
#define SRC_DAM_DAM1_LI1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038930u)
/** Alias (User Manual Name) for SRC_DAM_DAM1_LI1.
* To use register names with standard convension, please use SRC_DAM_DAM1_LI1.
*/
#define SRC_DAM1LI1 (SRC_DAM_DAM1_LI1)

/** \brief 934, DAM1 Ready 1 Service Request */
#define SRC_DAM_DAM1_RI1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038934u)
/** Alias (User Manual Name) for SRC_DAM_DAM1_RI1.
* To use register names with standard convension, please use SRC_DAM_DAM1_RI1.
*/
#define SRC_DAM1RI1 (SRC_DAM_DAM1_RI1)

/** \brief 938, DAM1 DMA Ready Service Request */
#define SRC_DAM_DAM1_DR /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038938u)
/** Alias (User Manual Name) for SRC_DAM_DAM1_DR.
* To use register names with standard convension, please use SRC_DAM_DAM1_DR.
*/
#define SRC_DAM1DR (SRC_DAM_DAM1_DR)

/** \brief 93C, DAM1 Error Service Request */
#define SRC_DAM_DAM1_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF003893Cu)
/** Alias (User Manual Name) for SRC_DAM_DAM1_ERR.
* To use register names with standard convension, please use SRC_DAM_DAM1_ERR.
*/
#define SRC_DAM1ERR (SRC_DAM_DAM1_ERR)

/** \brief 950, PSI5-S Service Request 0 */
#define SRC_PSI5S_PSI5S0_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038950u)
/** Alias (User Manual Name) for SRC_PSI5S_PSI5S0_SR0.
* To use register names with standard convension, please use SRC_PSI5S_PSI5S0_SR0.
*/
#define SRC_PSI5S0 (SRC_PSI5S_PSI5S0_SR0)

/** \brief 954, PSI5-S Service Request 1 */
#define SRC_PSI5S_PSI5S0_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038954u)
/** Alias (User Manual Name) for SRC_PSI5S_PSI5S0_SR1.
* To use register names with standard convension, please use SRC_PSI5S_PSI5S0_SR1.
*/
#define SRC_PSI5S1 (SRC_PSI5S_PSI5S0_SR1)

/** \brief 958, PSI5-S Service Request 2 */
#define SRC_PSI5S_PSI5S0_SR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038958u)
/** Alias (User Manual Name) for SRC_PSI5S_PSI5S0_SR2.
* To use register names with standard convension, please use SRC_PSI5S_PSI5S0_SR2.
*/
#define SRC_PSI5S2 (SRC_PSI5S_PSI5S0_SR2)

/** \brief 95C, PSI5-S Service Request 3 */
#define SRC_PSI5S_PSI5S0_SR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF003895Cu)
/** Alias (User Manual Name) for SRC_PSI5S_PSI5S0_SR3.
* To use register names with standard convension, please use SRC_PSI5S_PSI5S0_SR3.
*/
#define SRC_PSI5S3 (SRC_PSI5S_PSI5S0_SR3)

/** \brief 960, PSI5-S Service Request 4 */
#define SRC_PSI5S_PSI5S0_SR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038960u)
/** Alias (User Manual Name) for SRC_PSI5S_PSI5S0_SR4.
* To use register names with standard convension, please use SRC_PSI5S_PSI5S0_SR4.
*/
#define SRC_PSI5S4 (SRC_PSI5S_PSI5S0_SR4)

/** \brief 964, PSI5-S Service Request 5 */
#define SRC_PSI5S_PSI5S0_SR5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038964u)
/** Alias (User Manual Name) for SRC_PSI5S_PSI5S0_SR5.
* To use register names with standard convension, please use SRC_PSI5S_PSI5S0_SR5.
*/
#define SRC_PSI5S5 (SRC_PSI5S_PSI5S0_SR5)

/** \brief 968, PSI5-S Service Request 6 */
#define SRC_PSI5S_PSI5S0_SR6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038968u)
/** Alias (User Manual Name) for SRC_PSI5S_PSI5S0_SR6.
* To use register names with standard convension, please use SRC_PSI5S_PSI5S0_SR6.
*/
#define SRC_PSI5S6 (SRC_PSI5S_PSI5S0_SR6)

/** \brief 96C, PSI5-S Service Request 7 */
#define SRC_PSI5S_PSI5S0_SR7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF003896Cu)
/** Alias (User Manual Name) for SRC_PSI5S_PSI5S0_SR7.
* To use register names with standard convension, please use SRC_PSI5S_PSI5S0_SR7.
*/
#define SRC_PSI5S7 (SRC_PSI5S_PSI5S0_SR7)

/** \brief 970, Radar Interface 0 Error Service Request */
#define SRC_RIF_RIF0_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038970u)
/** Alias (User Manual Name) for SRC_RIF_RIF0_ERR.
* To use register names with standard convension, please use SRC_RIF_RIF0_ERR.
*/
#define SRC_RIF0ERR (SRC_RIF_RIF0_ERR)

/** \brief 974, Radar Interface 0 Service Request */
#define SRC_RIF_RIF0_INT /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038974u)
/** Alias (User Manual Name) for SRC_RIF_RIF0_INT.
* To use register names with standard convension, please use SRC_RIF_RIF0_INT.
*/
#define SRC_RIF0INT (SRC_RIF_RIF0_INT)

/** \brief 978, Radar Interface 1 Error Service Request */
#define SRC_RIF_RIF1_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038978u)
/** Alias (User Manual Name) for SRC_RIF_RIF1_ERR.
* To use register names with standard convension, please use SRC_RIF_RIF1_ERR.
*/
#define SRC_RIF1ERR (SRC_RIF_RIF1_ERR)

/** \brief 97C, Radar Interface 1 Service Request */
#define SRC_RIF_RIF1_INT /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF003897Cu)
/** Alias (User Manual Name) for SRC_RIF_RIF1_INT.
* To use register names with standard convension, please use SRC_RIF_RIF1_INT.
*/
#define SRC_RIF1INT (SRC_RIF_RIF1_INT)

/** \brief 980, SPU 0 Service Request */
#define SRC_SPU_SPU0_INT /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038980u)
/** Alias (User Manual Name) for SRC_SPU_SPU0_INT.
* To use register names with standard convension, please use SRC_SPU_SPU0_INT.
*/
#define SRC_SPU0INT (SRC_SPU_SPU0_INT)

/** \brief 984, SPU 0 Error Service Request */
#define SRC_SPU_SPU0_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038984u)
/** Alias (User Manual Name) for SRC_SPU_SPU0_ERR.
* To use register names with standard convension, please use SRC_SPU_SPU0_ERR.
*/
#define SRC_SPU0ERR (SRC_SPU_SPU0_ERR)

/** \brief 988, SPU 1 Service Request */
#define SRC_SPU_SPU1_INT /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038988u)
/** Alias (User Manual Name) for SRC_SPU_SPU1_INT.
* To use register names with standard convension, please use SRC_SPU_SPU1_INT.
*/
#define SRC_SPU1INT (SRC_SPU_SPU1_INT)

