Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxSrc_reg.h
/** \brief C54, TIM6 Shared Service Request 1 */
#define SRC_GTM_TIM6_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C54u)
/** Alias (User Manual Name) for SRC_GTM_TIM6_1.
* To use register names with standard convension, please use SRC_GTM_TIM6_1.
*/
#define SRC_GTMTIM61 (SRC_GTM_TIM6_1)

/** \brief C58, TIM6 Shared Service Request 2 */
#define SRC_GTM_TIM6_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C58u)
/** Alias (User Manual Name) for SRC_GTM_TIM6_2.
* To use register names with standard convension, please use SRC_GTM_TIM6_2.
*/
#define SRC_GTMTIM62 (SRC_GTM_TIM6_2)

/** \brief C5C, TIM6 Shared Service Request 3 */
#define SRC_GTM_TIM6_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C5Cu)
/** Alias (User Manual Name) for SRC_GTM_TIM6_3.
* To use register names with standard convension, please use SRC_GTM_TIM6_3.
*/
#define SRC_GTMTIM63 (SRC_GTM_TIM6_3)

/** \brief C60, TIM6 Shared Service Request 4 */
#define SRC_GTM_TIM6_4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C60u)
/** Alias (User Manual Name) for SRC_GTM_TIM6_4.
* To use register names with standard convension, please use SRC_GTM_TIM6_4.
*/
#define SRC_GTMTIM64 (SRC_GTM_TIM6_4)

/** \brief C64, TIM6 Shared Service Request 5 */
#define SRC_GTM_TIM6_5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C64u)
/** Alias (User Manual Name) for SRC_GTM_TIM6_5.
* To use register names with standard convension, please use SRC_GTM_TIM6_5.
*/
#define SRC_GTMTIM65 (SRC_GTM_TIM6_5)

/** \brief C68, TIM6 Shared Service Request 6 */
#define SRC_GTM_TIM6_6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C68u)
/** Alias (User Manual Name) for SRC_GTM_TIM6_6.
* To use register names with standard convension, please use SRC_GTM_TIM6_6.
*/
#define SRC_GTMTIM66 (SRC_GTM_TIM6_6)

/** \brief C6C, TIM6 Shared Service Request 7 */
#define SRC_GTM_TIM6_7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C6Cu)
/** Alias (User Manual Name) for SRC_GTM_TIM6_7.
* To use register names with standard convension, please use SRC_GTM_TIM6_7.
*/
#define SRC_GTMTIM67 (SRC_GTM_TIM6_7)

/** \brief C70, TIM7 Shared Service Request 0 */
#define SRC_GTM_TIM7_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C70u)
/** Alias (User Manual Name) for SRC_GTM_TIM7_0.
* To use register names with standard convension, please use SRC_GTM_TIM7_0.
*/
#define SRC_GTMTIM70 (SRC_GTM_TIM7_0)

/** \brief C74, TIM7 Shared Service Request 1 */
#define SRC_GTM_TIM7_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C74u)
/** Alias (User Manual Name) for SRC_GTM_TIM7_1.
* To use register names with standard convension, please use SRC_GTM_TIM7_1.
*/
#define SRC_GTMTIM71 (SRC_GTM_TIM7_1)

/** \brief C78, TIM7 Shared Service Request 2 */
#define SRC_GTM_TIM7_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C78u)
/** Alias (User Manual Name) for SRC_GTM_TIM7_2.
* To use register names with standard convension, please use SRC_GTM_TIM7_2.
*/
#define SRC_GTMTIM72 (SRC_GTM_TIM7_2)

/** \brief C7C, TIM7 Shared Service Request 3 */
#define SRC_GTM_TIM7_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C7Cu)
/** Alias (User Manual Name) for SRC_GTM_TIM7_3.
* To use register names with standard convension, please use SRC_GTM_TIM7_3.
*/
#define SRC_GTMTIM73 (SRC_GTM_TIM7_3)

/** \brief C80, TIM7 Shared Service Request 4 */
#define SRC_GTM_TIM7_4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C80u)
/** Alias (User Manual Name) for SRC_GTM_TIM7_4.
* To use register names with standard convension, please use SRC_GTM_TIM7_4.
*/
#define SRC_GTMTIM74 (SRC_GTM_TIM7_4)

/** \brief C84, TIM7 Shared Service Request 5 */
#define SRC_GTM_TIM7_5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C84u)
/** Alias (User Manual Name) for SRC_GTM_TIM7_5.
* To use register names with standard convension, please use SRC_GTM_TIM7_5.
*/
#define SRC_GTMTIM75 (SRC_GTM_TIM7_5)

/** \brief C88, TIM7 Shared Service Request 6 */
#define SRC_GTM_TIM7_6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C88u)
/** Alias (User Manual Name) for SRC_GTM_TIM7_6.
* To use register names with standard convension, please use SRC_GTM_TIM7_6.
*/
#define SRC_GTMTIM76 (SRC_GTM_TIM7_6)

/** \brief C8C, TIM7 Shared Service Request 7 */
#define SRC_GTM_TIM7_7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C8Cu)
/** Alias (User Manual Name) for SRC_GTM_TIM7_7.
* To use register names with standard convension, please use SRC_GTM_TIM7_7.
*/
#define SRC_GTMTIM77 (SRC_GTM_TIM7_7)

/** \brief CB0, MCS0 Shared Service Request 0 */
#define SRC_GTM_MCS0_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038CB0u)
/** Alias (User Manual Name) for SRC_GTM_MCS0_0.
* To use register names with standard convension, please use SRC_GTM_MCS0_0.
*/
#define SRC_GTMMCS00 (SRC_GTM_MCS0_0)

/** \brief CB4, MCS0 Shared Service Request 1 */
#define SRC_GTM_MCS0_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038CB4u)
/** Alias (User Manual Name) for SRC_GTM_MCS0_1.
* To use register names with standard convension, please use SRC_GTM_MCS0_1.
*/
#define SRC_GTMMCS01 (SRC_GTM_MCS0_1)

/** \brief CB8, MCS0 Shared Service Request 2 */
#define SRC_GTM_MCS0_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038CB8u)
/** Alias (User Manual Name) for SRC_GTM_MCS0_2.
* To use register names with standard convension, please use SRC_GTM_MCS0_2.
*/
#define SRC_GTMMCS02 (SRC_GTM_MCS0_2)

/** \brief CBC, MCS0 Shared Service Request 3 */
#define SRC_GTM_MCS0_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038CBCu)
/** Alias (User Manual Name) for SRC_GTM_MCS0_3.
* To use register names with standard convension, please use SRC_GTM_MCS0_3.
*/
#define SRC_GTMMCS03 (SRC_GTM_MCS0_3)

/** \brief CC0, MCS0 Shared Service Request 4 */
#define SRC_GTM_MCS0_4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038CC0u)
/** Alias (User Manual Name) for SRC_GTM_MCS0_4.
* To use register names with standard convension, please use SRC_GTM_MCS0_4.
*/
#define SRC_GTMMCS04 (SRC_GTM_MCS0_4)

/** \brief CC4, MCS0 Shared Service Request 5 */
#define SRC_GTM_MCS0_5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038CC4u)
/** Alias (User Manual Name) for SRC_GTM_MCS0_5.
* To use register names with standard convension, please use SRC_GTM_MCS0_5.
*/
#define SRC_GTMMCS05 (SRC_GTM_MCS0_5)

/** \brief CC8, MCS0 Shared Service Request 6 */
#define SRC_GTM_MCS0_6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038CC8u)
/** Alias (User Manual Name) for SRC_GTM_MCS0_6.
* To use register names with standard convension, please use SRC_GTM_MCS0_6.
*/
#define SRC_GTMMCS06 (SRC_GTM_MCS0_6)

/** \brief CCC, MCS0 Shared Service Request 7 */
#define SRC_GTM_MCS0_7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038CCCu)
/** Alias (User Manual Name) for SRC_GTM_MCS0_7.
* To use register names with standard convension, please use SRC_GTM_MCS0_7.
*/
#define SRC_GTMMCS07 (SRC_GTM_MCS0_7)

/** \brief CD0, MCS1 Shared Service Request 0 */
#define SRC_GTM_MCS1_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038CD0u)
/** Alias (User Manual Name) for SRC_GTM_MCS1_0.
* To use register names with standard convension, please use SRC_GTM_MCS1_0.
*/
#define SRC_GTMMCS10 (SRC_GTM_MCS1_0)

/** \brief CD4, MCS1 Shared Service Request 1 */
#define SRC_GTM_MCS1_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038CD4u)
/** Alias (User Manual Name) for SRC_GTM_MCS1_1.
* To use register names with standard convension, please use SRC_GTM_MCS1_1.
*/
#define SRC_GTMMCS11 (SRC_GTM_MCS1_1)

