Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxSrc_reg.h
/** \brief D94, MCS7 Shared Service Request 1 */
#define SRC_GTM_MCS7_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D94u)
/** Alias (User Manual Name) for SRC_GTM_MCS7_1.
* To use register names with standard convension, please use SRC_GTM_MCS7_1.
*/
#define SRC_GTMMCS71 (SRC_GTM_MCS7_1)

/** \brief D98, MCS7 Shared Service Request 2 */
#define SRC_GTM_MCS7_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D98u)
/** Alias (User Manual Name) for SRC_GTM_MCS7_2.
* To use register names with standard convension, please use SRC_GTM_MCS7_2.
*/
#define SRC_GTMMCS72 (SRC_GTM_MCS7_2)

/** \brief D9C, MCS7 Shared Service Request 3 */
#define SRC_GTM_MCS7_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D9Cu)
/** Alias (User Manual Name) for SRC_GTM_MCS7_3.
* To use register names with standard convension, please use SRC_GTM_MCS7_3.
*/
#define SRC_GTMMCS73 (SRC_GTM_MCS7_3)

/** \brief DA0, MCS7 Shared Service Request 4 */
#define SRC_GTM_MCS7_4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DA0u)
/** Alias (User Manual Name) for SRC_GTM_MCS7_4.
* To use register names with standard convension, please use SRC_GTM_MCS7_4.
*/
#define SRC_GTMMCS74 (SRC_GTM_MCS7_4)

/** \brief DA4, MCS7 Shared Service Request 5 */
#define SRC_GTM_MCS7_5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DA4u)
/** Alias (User Manual Name) for SRC_GTM_MCS7_5.
* To use register names with standard convension, please use SRC_GTM_MCS7_5.
*/
#define SRC_GTMMCS75 (SRC_GTM_MCS7_5)

/** \brief DA8, MCS7 Shared Service Request 6 */
#define SRC_GTM_MCS7_6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DA8u)
/** Alias (User Manual Name) for SRC_GTM_MCS7_6.
* To use register names with standard convension, please use SRC_GTM_MCS7_6.
*/
#define SRC_GTMMCS76 (SRC_GTM_MCS7_6)

/** \brief DAC, MCS7 Shared Service Request 7 */
#define SRC_GTM_MCS7_7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DACu)
/** Alias (User Manual Name) for SRC_GTM_MCS7_7.
* To use register names with standard convension, please use SRC_GTM_MCS7_7.
*/
#define SRC_GTMMCS77 (SRC_GTM_MCS7_7)

/** \brief DB0, MCS8 Shared Service Request 0 */
#define SRC_GTM_MCS8_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DB0u)
/** Alias (User Manual Name) for SRC_GTM_MCS8_0.
* To use register names with standard convension, please use SRC_GTM_MCS8_0.
*/
#define SRC_GTMMCS80 (SRC_GTM_MCS8_0)

/** \brief DB4, MCS8 Shared Service Request 1 */
#define SRC_GTM_MCS8_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DB4u)
/** Alias (User Manual Name) for SRC_GTM_MCS8_1.
* To use register names with standard convension, please use SRC_GTM_MCS8_1.
*/
#define SRC_GTMMCS81 (SRC_GTM_MCS8_1)

/** \brief DB8, MCS8 Shared Service Request 2 */
#define SRC_GTM_MCS8_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DB8u)
/** Alias (User Manual Name) for SRC_GTM_MCS8_2.
* To use register names with standard convension, please use SRC_GTM_MCS8_2.
*/
#define SRC_GTMMCS82 (SRC_GTM_MCS8_2)

/** \brief DBC, MCS8 Shared Service Request 3 */
#define SRC_GTM_MCS8_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DBCu)
/** Alias (User Manual Name) for SRC_GTM_MCS8_3.
* To use register names with standard convension, please use SRC_GTM_MCS8_3.
*/
#define SRC_GTMMCS83 (SRC_GTM_MCS8_3)

/** \brief DC0, MCS8 Shared Service Request 4 */
#define SRC_GTM_MCS8_4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DC0u)
/** Alias (User Manual Name) for SRC_GTM_MCS8_4.
* To use register names with standard convension, please use SRC_GTM_MCS8_4.
*/
#define SRC_GTMMCS84 (SRC_GTM_MCS8_4)

/** \brief DC4, MCS8 Shared Service Request 5 */
#define SRC_GTM_MCS8_5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DC4u)
/** Alias (User Manual Name) for SRC_GTM_MCS8_5.
* To use register names with standard convension, please use SRC_GTM_MCS8_5.
*/
#define SRC_GTMMCS85 (SRC_GTM_MCS8_5)

/** \brief DC8, MCS8 Shared Service Request 6 */
#define SRC_GTM_MCS8_6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DC8u)
/** Alias (User Manual Name) for SRC_GTM_MCS8_6.
* To use register names with standard convension, please use SRC_GTM_MCS8_6.
*/
#define SRC_GTMMCS86 (SRC_GTM_MCS8_6)

/** \brief DCC, MCS8 Shared Service Request 7 */
#define SRC_GTM_MCS8_7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DCCu)
/** Alias (User Manual Name) for SRC_GTM_MCS8_7.
* To use register names with standard convension, please use SRC_GTM_MCS8_7.
*/
#define SRC_GTMMCS87 (SRC_GTM_MCS8_7)

/** \brief DD0, MCS9 Shared Service Request 0 */
#define SRC_GTM_MCS9_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DD0u)
/** Alias (User Manual Name) for SRC_GTM_MCS9_0.
* To use register names with standard convension, please use SRC_GTM_MCS9_0.
*/
#define SRC_GTMMCS90 (SRC_GTM_MCS9_0)

/** \brief DD4, MCS9 Shared Service Request 1 */
#define SRC_GTM_MCS9_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DD4u)
/** Alias (User Manual Name) for SRC_GTM_MCS9_1.
* To use register names with standard convension, please use SRC_GTM_MCS9_1.
*/
#define SRC_GTMMCS91 (SRC_GTM_MCS9_1)

/** \brief DD8, MCS9 Shared Service Request 2 */
#define SRC_GTM_MCS9_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DD8u)
/** Alias (User Manual Name) for SRC_GTM_MCS9_2.
* To use register names with standard convension, please use SRC_GTM_MCS9_2.
*/
#define SRC_GTMMCS92 (SRC_GTM_MCS9_2)

/** \brief DDC, MCS9 Shared Service Request 3 */
#define SRC_GTM_MCS9_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DDCu)
/** Alias (User Manual Name) for SRC_GTM_MCS9_3.
* To use register names with standard convension, please use SRC_GTM_MCS9_3.
*/
#define SRC_GTMMCS93 (SRC_GTM_MCS9_3)

/** \brief DE0, MCS9 Shared Service Request 4 */
#define SRC_GTM_MCS9_4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DE0u)
/** Alias (User Manual Name) for SRC_GTM_MCS9_4.
* To use register names with standard convension, please use SRC_GTM_MCS9_4.
*/
#define SRC_GTMMCS94 (SRC_GTM_MCS9_4)

/** \brief DE4, MCS9 Shared Service Request 5 */
#define SRC_GTM_MCS9_5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DE4u)
/** Alias (User Manual Name) for SRC_GTM_MCS9_5.
* To use register names with standard convension, please use SRC_GTM_MCS9_5.
*/
#define SRC_GTMMCS95 (SRC_GTM_MCS9_5)

/** \brief DE8, MCS9 Shared Service Request 6 */
#define SRC_GTM_MCS9_6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DE8u)
/** Alias (User Manual Name) for SRC_GTM_MCS9_6.
* To use register names with standard convension, please use SRC_GTM_MCS9_6.
*/
#define SRC_GTMMCS96 (SRC_GTM_MCS9_6)

/** \brief DEC, MCS9 Shared Service Request 7 */
#define SRC_GTM_MCS9_7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DECu)
/** Alias (User Manual Name) for SRC_GTM_MCS9_7.
* To use register names with standard convension, please use SRC_GTM_MCS9_7.
*/
#define SRC_GTMMCS97 (SRC_GTM_MCS9_7)

/** \brief E10, TOM0 Shared Service Request 0 */
#define SRC_GTM_TOM0_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E10u)
/** Alias (User Manual Name) for SRC_GTM_TOM0_0.
* To use register names with standard convension, please use SRC_GTM_TOM0_0.
*/
#define SRC_GTMTOM00 (SRC_GTM_TOM0_0)

