Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxSrc_reg.h
/** \brief F98, ATOM10 Shared Service Request 2 */
#define SRC_GTM_ATOM10_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F98u)
/** Alias (User Manual Name) for SRC_GTM_ATOM10_2.
* To use register names with standard convension, please use SRC_GTM_ATOM10_2.
*/
#define SRC_GTMATOM102 (SRC_GTM_ATOM10_2)

/** \brief F9C, ATOM10 Shared Service Request 3 */
#define SRC_GTM_ATOM10_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F9Cu)
/** Alias (User Manual Name) for SRC_GTM_ATOM10_3.
* To use register names with standard convension, please use SRC_GTM_ATOM10_3.
*/
#define SRC_GTMATOM103 (SRC_GTM_ATOM10_3)

/** \brief FA0, ATOM11 Shared Service Request 0 */
#define SRC_GTM_ATOM11_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038FA0u)
/** Alias (User Manual Name) for SRC_GTM_ATOM11_0.
* To use register names with standard convension, please use SRC_GTM_ATOM11_0.
*/
#define SRC_GTMATOM110 (SRC_GTM_ATOM11_0)

/** \brief FA4, ATOM11 Shared Service Request 1 */
#define SRC_GTM_ATOM11_1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038FA4u)
/** Alias (User Manual Name) for SRC_GTM_ATOM11_1.
* To use register names with standard convension, please use SRC_GTM_ATOM11_1.
*/
#define SRC_GTMATOM111 (SRC_GTM_ATOM11_1)

/** \brief FA8, ATOM11 Shared Service Request 2 */
#define SRC_GTM_ATOM11_2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038FA8u)
/** Alias (User Manual Name) for SRC_GTM_ATOM11_2.
* To use register names with standard convension, please use SRC_GTM_ATOM11_2.
*/
#define SRC_GTMATOM112 (SRC_GTM_ATOM11_2)

/** \brief FAC, ATOM11 Shared Service Request 3 */
#define SRC_GTM_ATOM11_3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038FACu)
/** Alias (User Manual Name) for SRC_GTM_ATOM11_3.
* To use register names with standard convension, please use SRC_GTM_ATOM11_3.
*/
#define SRC_GTMATOM113 (SRC_GTM_ATOM11_3)

/** \brief FD0, GTM Multi Channel Sequencer Service Request 0 */
#define SRC_GTM_MCSW0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038FD0u)
/** Alias (User Manual Name) for SRC_GTM_MCSW0.
* To use register names with standard convension, please use SRC_GTM_MCSW0.
*/
#define SRC_GTMMCSW0 (SRC_GTM_MCSW0)

/** \brief FD4, GTM Multi Channel Sequencer Service Request 1 */
#define SRC_GTM_MCSW1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038FD4u)
/** Alias (User Manual Name) for SRC_GTM_MCSW1.
* To use register names with standard convension, please use SRC_GTM_MCSW1.
*/
#define SRC_GTMMCSW1 (SRC_GTM_MCSW1)

/** \brief FD8, GTM Multi Channel Sequencer Service Request 2 */
#define SRC_GTM_MCSW2 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038FD8u)
/** Alias (User Manual Name) for SRC_GTM_MCSW2.
* To use register names with standard convension, please use SRC_GTM_MCSW2.
*/
#define SRC_GTMMCSW2 (SRC_GTM_MCSW2)

/** \brief FDC, GTM Multi Channel Sequencer Service Request 3 */
#define SRC_GTM_MCSW3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038FDCu)
/** Alias (User Manual Name) for SRC_GTM_MCSW3.
* To use register names with standard convension, please use SRC_GTM_MCSW3.
*/
#define SRC_GTMMCSW3 (SRC_GTM_MCSW3)

/** \brief FE0, GTM Multi Channel Sequencer Service Request 4 */
#define SRC_GTM_MCSW4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038FE0u)
/** Alias (User Manual Name) for SRC_GTM_MCSW4.
* To use register names with standard convension, please use SRC_GTM_MCSW4.
*/
#define SRC_GTMMCSW4 (SRC_GTM_MCSW4)

/** \brief FE4, GTM Multi Channel Sequencer Service Request 5 */
#define SRC_GTM_MCSW5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038FE4u)
/** Alias (User Manual Name) for SRC_GTM_MCSW5.
* To use register names with standard convension, please use SRC_GTM_MCSW5.
*/
#define SRC_GTMMCSW5 (SRC_GTM_MCSW5)

/** \brief FE8, GTM Multi Channel Sequencer Service Request 6 */
#define SRC_GTM_MCSW6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038FE8u)
/** Alias (User Manual Name) for SRC_GTM_MCSW6.
* To use register names with standard convension, please use SRC_GTM_MCSW6.
*/
#define SRC_GTMMCSW6 (SRC_GTM_MCSW6)

/** \brief FEC, GTM Multi Channel Sequencer Service Request 7 */
#define SRC_GTM_MCSW7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038FECu)
/** Alias (User Manual Name) for SRC_GTM_MCSW7.
* To use register names with standard convension, please use SRC_GTM_MCSW7.
*/
#define SRC_GTMMCSW7 (SRC_GTM_MCSW7)

/** \brief FF0, GTM Multi Channel Sequencer Service Request 8 */
#define SRC_GTM_MCSW8 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038FF0u)
/** Alias (User Manual Name) for SRC_GTM_MCSW8.
* To use register names with standard convension, please use SRC_GTM_MCSW8.
*/
#define SRC_GTMMCSW8 (SRC_GTM_MCSW8)

/** \brief FF4, GTM Multi Channel Sequencer Service Request 9 */
#define SRC_GTM_MCSW9 /*lint --e(923, 9078)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038FF4u)
/** Alias (User Manual Name) for SRC_GTM_MCSW9.
* To use register names with standard convension, please use SRC_GTM_MCSW9.
*/
#define SRC_GTMMCSW9 (SRC_GTM_MCSW9)


/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXSRC_REG_H */
